{
  "staff": [
    {
      "id": 1,
      "name": "Tanya Apana",
      "position": "Founder, Director, Science Teacher",
      "description": "I received my BS in Biology, science teaching certification and Masters in Education for Transformative School Leadership from Iowa State University. I started my teaching career as a high school science teacher but finally found my niche creating an independent learning community. I have been leading Main Street School since its inception in 2006. Apart from a passion for teaching, I enjoy spending time with my 3 kids and 2 dogs, travelling, digging in the dirt and playing in nature.",
      "photo_url": "img/staff/tanya-apana.jpg",
      "email": "tanya@mainstschool.org"
    },
    {
      "id": 2,
      "name": "Claire Bennett",
      "position": "Elementary Teacher",
      "description": "I graduated from Simpson College with my degree in Elementary Education and endorsements in Special Education and Reading. I taught in the public school setting for two years before returning to Main Street as a teacher. I say returning because I was a student at Main Street School through my middle school years. I have many wonderful memories of my time at this school, and I love that I get to teach here every day. When I am not teaching, I love spending time with my family and friends. I also love being a dog mom to my beloved dog, Cheese.",
      "photo_url": "img/staff/claire-bennett.jpg",
      "email": "claire@mainstschool.org"
    },
    {
      "id": 3,
      "name": "Lori Wiedmaier",
      "position": "Lead Primary Teacher",
      "description": "I received my early childhood education at Northwest Missouri State University and have 24 years of experience at the preschool level. The last 6 have been at Main Street School. Each year I have spent in the classroom my heart has grown. I learn so much each day working with children. It truly is like I never have to go to work. I am so very lucky to get to come to Main Street School every day.When not teaching, I enjoy spending time with my family or baking. I am an avid runner and you can often find me out walking with my husband and dog, Benson.",
      "photo_url": "img/staff/lori-wiedmaier.jpg",
      "email": "lori@mainstschool.org"
    },
    {
      "id": 4,
      "name": "Isaac Anderson",
      "position": "Primary Assistant",
      "description": "I graduated from Iowa State University with degrees in Global Resource Systems and World Language and Cultures Spanish and a minor in Sustainable Development during Covid. With my plans for working internationally put on hold, I started at Main Street and found a true passion for working with young humans. My other passions include travelling and being in nature.",
      "photo_url": "img/staff/isaac-anderson.jpg",
      "email": "isaac@mainstschool.org"
    },
    {
      "id": 5,
      "name": "Sheri Florez",
      "position": "Secondary Teacher",
      "description": "I am Ms. Sheri, and I have taught at Main Street School for 9 years which happens to be longer than anywhere else in my 45-year teaching career. I have taught in a variety of schools, in a range of levels, in many different classrooms. I started my teaching career in the 1970s in Peace Corps/Zaire (Democratic Rep. of the Congo now) and went on to teach in Seattle, WA; Houston, TX: Knoxville and Indianola, IA as well as in private international schools in Turkey and Kuwait. Suffice it to say, I like to change climates from time to time. I love new experiences and learning about new places, cultures and people. That's one of the things that brought me to Main Street. I have loved the freedom to teach a curriculum that speaks to the interests of our kids while holding them to high standards. Teaching is said to be a career, but for me it has been my passion. When I am not teaching, you will find me enjoying my other passion: reading history and political science books on my porch with a glass of iced tea or coffee.",
      "photo_url": "img/staff/sheri-florez.jpg",
      "email": "sheri@mainstschool.org"
    },
    {
      "id": 6,
      "name": "Stacey Schuurmann",
      "position": "Art Teacher",
      "description": "I am the owner of a local arts and craft business and have a degree in Pre-Kindergarten education. I love all things crafty and creative and bring that passion into our art room while developing a foundation in the elements of art.",
      "photo_url": "img/staff/stacey-schuurmann.jpg",
      "email": "stacey@mainstschool.org"
    },
    {
      "id": 7,
      "name": "Andy Mogle",
      "position": "Secondary Teacher",
      "description": "Information coming soon...",
      "photo_url": "img/staff/andy-mogle.jpg",
      "email": "andy@mainstschool.org"
    },
    {
      "id": 8,
      "name": "Chuck Krueger",
      "position": "Secondary Teacher",
      "description": "Hi, my name is Chuck Krueger. My teaching career started in the Amana Colonies as a science teacher as a recent graduate of ISU with a BS degree. I had a double major in physics and psychology, and certification in most high school sciences and math. I continued my education at UI in two different programs, the first was solar engineering and the second was science education which were not career options for me but enhanced my knowledge of science and math. We moved to Kansas and I worked as a TAG (Talented and Gifted) teacher for several years. I got my M Ed. from Wichita State University.Eventually we moved to Bettendorf, Iowa where I worked in TAG and taught at Marycrest College. A move to Newton gave me the opportunity to teach for several years at Marshalltown Community College. Today, I enjoy retirement and the opportunity to continue working with students. It is a great joy to see the light bulb go on when a student gets it.",
      "photo_url": "img/staff/chuck-krueger.jpg",
      "email": "chuck@mainstschool.org"
    },
    {
      "id": 9,
      "name": "Sarah Jorgenson",
      "position": "Music Education",
      "description": "I have been teaching both privately and in the collegiate setting for nearly 20 years. I began my musical journey by graduating with a classical voice performance degree and extensive master's pedagogy classes from the University of NE- Lincoln. After an exciting career as a professional in musical theater, I met my husband and planted roots in Des Moines where I've taken on my favorite role of being a mama to four amazing kiddos. I am also the founding director of Rising Stars Show Choir 4 Kids, a non-audition fully inclusive choir for children of all ages and abilities and a teaching artist with City Voices Des Moines.",
      "photo_url": "img/staff/sarah-jorgenson.jpg",
      "email": "sarah@mainstschool.org"
    }
  ]
}
